blog/app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", ""], ["commenter", ""], ["created_at", Sat, 01 Feb 2014 19:11:49 UTC +00:00], ["post_id", 6], ["updated_at", Sat, 01 Feb 2014 19:11:49 UTC +00:00]]