blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 30 Jan 2014 09:20:40 UTC +00:00], ["text", ""], ["title", ""], ["updated_at", Thu, 30 Jan 2014 09:20:40 UTC +00:00]]
---
    def create
        @post = Post.new(post_params)
        if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]
---
    def show
        @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "qwrergd"], ["text", "erdgfv"], ["updated_at", Sat, 01 Feb 2014 00:24:31 UTC +00:00]]
---
    def update
    	@post = Post.find(params[:id])

        if @post.update(params[:post].permit(:title, :text))